# Интерполяция:
# a = 5
# b = 5.89
# c = 'hello'
# print("{} - {} - {}".format(a,b,c))


# Ввод данных (2 варианта):
# print('Введите первое число')
# a = input()
# b = input('Введите второе число: ')


# Перевод типов данных:
# print('Введите первое число')
# a = int(input())
# b = int(input('Введите второе число: '))
# print(a, '+', b, '=', a + b)


# Округление числа:
# a = 5.89956
# b = 6.556551
# print(round(a*b, 2))


# Управляющие конструкции if-else
# username = input('Введите имя: ')
# if username == 'Маша':
#     print('Ура, это же МАША!')
# elif username == 'Марина':
#     print('Я так ждала Вас, Марина!')
# elif username == 'Ильнар':
#     print('Ильнар - топ)')
# else:
#     print('Привет, ', username)


